Revit 2024 API
BoundarySegment.GetCurve Method
 Get a copy of the curve that is formed along this boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public Curve GetCurve()
Visual Basic
Public Function GetCurve As Curve
Visual C++
public:
Curve^ GetCurve()
Return Value
 A copy of the curve.
See Also
BoundarySegment Class
Autodesk.Revit.DB Namespace